<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Calories365 bot lang
    |--------------------------------------------------------------------------
    |
    |
    */
    'auth_required' => 'Вы должны быть авторизированны!',
    'error_retrieving_data' => 'Произошла ошибка при получении данных. Пожалуйста, попробуйте позже.',
    'no_entries_for_date' => 'У вас нет записей на дату *:date*.',
    'no_entries_for_part_of_day' => 'У вас нет записей :partOfDayText.',
    'your_data_for_date' => 'Ваши данные за *:date*:',
    'breakfast' => 'Завтрак',
    'lunch' => 'Обед',
    'dinner' => 'Ужин',
    'calories' => 'Калории',
    'proteins' => 'Белки',
    'fats' => 'Жиры',
    'carbohydrates' => 'Углеводы',
    'total_for_day' => 'Итого за день',
    'total_for_part_of_day' => 'Итого за :partOfDayName',
    'delete' => 'Удалить',
    'you_said'  => 'Вы сказали: ',
    'parameter' => 'Параметр',
    '100g'      => '100г',
    'g'         => 'г',
    'editing_session_expired' => 'Сессия редактирования истекла или отсутствует.',
    'product_not_found'       => 'Продукт не найден или истекло время сессии.',
    'editing_canceled' => 'Редактирование отменено.',
    'step_skipped'                        => 'Шаг пропущен.',
    'please_enter_new_quantity_of_grams'  => 'Пожалуйста, введите новое количество грамм.',
    'please_enter_new_calories'           => 'Пожалуйста, введите новое количество калорий.',
    'please_enter_new_proteins'           => 'Пожалуйста, введите новое количество белков.',
    'please_enter_new_fats'               => 'Пожалуйста, введите новое количество жиров.',
    'please_enter_new_carbohydrates'      => 'Пожалуйста, введите новое количество углеводов.',
    'error_editing_product'               => 'Произошла ошибка при редактировании продукта.',
    'exit_edit_mode' => 'Выйдите с режима редактирования (нажмите сохранить или отменить).',
    'action_canceled_product_list_cleared' => 'Действие отменено. Ваш список продуктов был очищен.',
    'cancellation_completed'               => 'Отмена выполнена',
    'product_list_is_empty_or_was_cleared' => 'Ваш список продуктов пуст или уже был очищен.',
    'list_is_already_empty'                => 'Список уже пуст',
    'product_removed_from_list' => 'Продукт удалён из списка.',
    'error_deleting_product' => 'Ошибка при удалении продукта.',
    'product_deleted' => 'Продукт удалён.',
    'you_are_editing_product'        => 'Вы редактируете продукт: *:productName*',
    'please_enter_new_product_name'  => 'Пожалуйста, введите новое название продукта.',
    'save'                           => 'Сохранить',
    'skip_step'                      => 'Пропустить шаг',
    'cancel'                         => 'Отменить',
    'invalid_request'                => 'Некорректный запрос.',
    'data_saved_you_consumed' => 'Данные сохранены, Вы употребили',
    'grams'                     => 'грамм',
    'error_processing_data'     => 'Произошла ошибка при обработке данных.',
    'error_generating_data'     => 'Произошла ошибка генерации данных.',
    'failed_to_get_product_data' => 'Не удалось получить данные о продукте.',
    'cannot_generate_product_data' => 'Извините, не удалось сгенерировать данные для этого продукта. Попробуйте отредактировать его вручную.',
    'product_data_updated'      => 'Данные продукта обновлены.',
    'value_too_long'                           => 'Значение слишком длинное',
    'enter_valid_numeric_value_for_grams'      => 'Пожалуйста, введите корректное числовое значение для грамм.',
    'enter_valid_numeric_value_for_calories'   => 'Пожалуйста, введите корректное числовое значение для калорий.',
    'enter_valid_numeric_value_for_proteins'   => 'Пожалуйста, введите корректное числовое значение для белков.',
    'enter_valid_numeric_value_for_fats'       => 'Пожалуйста, введите корректное числовое значение для жиров.',
    'enter_valid_numeric_value_for_carbohydrates' => 'Пожалуйста, введите корректное числовое значение для углеводов.',
    'please_choose_your_language' => 'Пожалуйста, выберите язык',
    'language_set_english'        => 'Ваш язык установлен на английский.',
    'language_set_russian'        => 'Ваш язык установлен на русский.',
    'language_set_ukrainian'      => 'Ваш язык установлен на украинский.',
    'invalid_or_used_code' => 'Код недействителен или уже использован. Пожалуйста, зарегистрируйтесь заново.',
    'seems_you_are_new'    => 'Похоже, вы здесь впервые. Чтобы связать аккаунт, используйте ссылку «Подключить» из личного кабинета (https://calculator.calories365.com?lang=ru).',
    'error_occurred' => 'Произошла ошибка: ',
    'incomplete_product_info' => 'Информация о продукте неполная.',
    'save_products_for' => 'Сохранить продукты на:',
    'products_not_found' => 'Продукты не найдены.',
    'failed_to_recognize_audio_message' => 'Не удалось распознать аудио сообщение.',
    'not_an_audio_message_received' => 'Получено не аудио сообщение.',
    'changes_saved' => 'Изменения сохранены.',
    'changes_canceled' => 'Изменения отменены.',
    'message_not_modified' => 'Сообщение не изменилось, обновление не требуется.',
    'search' => 'Искать',
    'generate_with_ai' => 'Сгенерировать с помощью ИИ',
    'edit' => 'Изменить',
    'you_must_be_authorized' => 'Вы должны быть авторизированны!',
    'no_entries_remain' => 'Продуктов не осталось',
    'subscription_required_message' => "Лимит запросов исчерпан, чтобы сохранять приемы пищи без ограничений - купите перемиум в личном кабинете (https://calculator.calories365.com?lang=ru)",
    'prompt_analyze_food_intake' => <<<EOT
Анализируй текст: ":text". Выведи только список продуктов с указанием количества в граммах. Если количество не указано, используй среднестатистический вес или порцию. Формат вывода должен строго соответствовать следующему примеру, где после каждого продукта стоит точка с запятой:

Пример:
Картошка - 100 грамм;
Помидор - 120 грамм;
Курица221 - 200 грамм;

Если в тексте нет продуктов, выведи: 'продуктов нет'.

Важно:
- Все количества должны быть в граммах.
- После каждого продукта обязательно ставь точку с запятой.
- Не добавляй никакой дополнительной информации кроме списка продуктов.
- Продукт может содержать буквы и цифры (например, курица221 или курица два два один). Сохраняй полные названия продуктов без изменений.
- Если продукт имеет описательные слова (например, вареный картофель), переставляй описание после названия продукта (например, 'вареный картофель' → 'картофель вареный').
- Убедись, что каждый продукт и его количество разделены тире и пробелами, как в примере.
- Не изменяй исходное название продукта, даже если оно содержит цифры или нестандартные символы.
- Если пользователь говорит, что он съел два чего-то, к примеру, две конфеты, то надо выводить вес двух конфет как один продукт.
- Если пользователь говорит, что съел или выпил ноль пять пива (0.5), то тебе нужно это тоже учитывать и добавлять в выходной текст.

Примеры входного текста и ожидаемого вывода:

1. Входной текст: 'Я съел 100 грамм картошки и помидор.'
   Ожидаемый вывод:
   Картошка - 100 грамм;
   Помидор - 120 грамм;

2. Входной текст: 'Я съел 100 грамм картошки, помидор и курица221.'
   Ожидаемый вывод:
   Картошка - 100 грамм;
   Помидор - 120 грамм;
   Курица221 - 200 грамм;

3. Входной текст: 'Я съел 100 грамм картошки, помидор и курица два два один.'
   Ожидаемый вывод:
   Картошка - 100 грамм;
   Помидор - 120 грамм;
   Курица два два один - 200 грамм;

4. Входной текст: 'Я съел вареный картофель'
   Ожидаемый вывод:
   Картофель вареный - 200 грамм;

5. Входной текст: 'Сегодня ничего не ел.'
   Ожидаемый вывод:
   продуктов нет

6. Входной текст: 'Я съел два яйца'
   Ожидаемый вывод:
   Яйцо - 120 грамм;

7. Входной текст: 'Я съел две конфеты'
   Ожидаемый вывод:
   Конфета - 20 грамм;

8. Входной текст: "Я выпил ноль пять пива"
   Ожидаемый вывод:
   Пиво – 500 грамм;
EOT,

    'prompt_generate_new_product_data' => <<<EOT
Есть продукт: ":text". Выведи КБЖУ (Калории, Белки, Жиры, Углеводы) на 100 грамм продукта.
Формат вывода должен строго соответствовать следующему примеру, где после каждого параметра стоит точка с запятой:

Пример: Калории - 890; Белки - 0.2; Жиры - 100; Углеводы - 0;

Важно:

- Все значения должны соответствовать 100 граммам продукта.
- После каждого параметра обязательно ставь точку с запятой.
- Не добавляй никакой дополнительной информации кроме списка КБЖУ.
- Название продукта сохраняй без изменений, даже если оно содержит цифры или нестандартные символы.
- Убедись, что каждый параметр и его значение разделены тире и пробелами, как в примере.
- Также учти, что пользователь может говорить названия продуктов как общие или брендовые, например, 'Halls' или 'Конфета Bob and Snail'. Такое тоже надо распознавать и возвращать информацию.

Пример входного текста:
Калории - 890; Белки - 0.2; Жиры - 100; Углеводы - 0;
EOT,

    'prompt_choose_relevant_products_part' => <<<EOT
Какой продукт наиболее соответствует названию ":name"? Вот доступные варианты: :productNames.
EOT,

    'prompt_choose_relevant_products_footer' => <<<EOT
Верни ответ в следующем формате:
название продукта1 - id;
название продукта2 - id;
если подходящего продукта нет, то ответ должен быть в формате
название продукта - (его калораж на 100грамм, белки, жиры, углеводы);
EOT,

    'data_not_extracted' => 'Не удалось извлечь данные.',
    'welcome_guide' => <<<EOT
Видео инструкция: https://t.me/calories_365/4

Запишите боту голосовое сообщение с тем, что вы съели, чтобы добавить запись в дневник.

Сохранённые продукты отобразятся в веб-приложении:
https://calculator.calories365.com?lang=ru

Также вы можете посмотреть видео для ознакомления с ботом.

Начните вести свой дневник калорий легко и удобно!
EOT,

    'welcome_guide_KNU' => <<<EOT
Добро пожаловать в бот "Калорий 365"! Вот как им пользоваться:

1)Голосовой ввод: Отправьте голосовое сообщение с тем, что вы съели за приём пищи. Бот распознает продукты и составит список.

2)Редактирование списка:

Нажмите кнопку «Изменить», чтобы вручную исправить название, калории, белки, жиры или углеводы.

Нажмите кнопку «Искать», чтобы найти новое значение КБЖУ продукта. Если после первого нажатие вас не устроит результат поиска - нажмите еще раз!

3)Сохранение:

Нажмите кнопку «Сохранить», чтобы сохранить данные в ваш дневник.

Ссылка на приложение: https://calculator.calories365.xyz?lang=ru


Начните вести свой дневник калорий легко и удобно!

EOT,
    'menu'             => 'Меню',
    'statistics'       => 'Статистика',
    'choose_language'  => 'Выбор языка',
    'feedback'         => 'Обратная связь',
    'whole_day' => 'Весь день',
    'send_feedback_email' => 'Вы можете отправить свой отзыв администратору: @calories365_admin',
];
